# HostObjectUtils Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HostObjectUtils Methods
HostObjectUtils Class See Also
---
The HostObjectUtils type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetBottomFaces | Returns the bottom faces for this host object. |
| GetSideFaces | Returns the major side faces for this host object. |
| GetTopFaces | Returns the top faces for this host object. |

# See Also
HostObjectUtils Class
Autodesk.Revit.DB Namespace